Tekla.Structures.Drawing.ReinforcementSetGroup.Attributes
The attributes of the reinforcement.
For more information see Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.

Tekla.Structures.Drawing.ReinforcementSetGroup.ReinforcementCustomPosition
Defines the location of the reinforcement bar when using ReinforcementVisibility == ReinforcementVisibilityTypes.Customized.
This location is a value between 0.0 and 1.0 and it defines the proportion from the reinforcement's start point.

Tekla.Structures.Drawing.ReinforcementSetGroup.#ctor
Create instance of ReinforcementSetGroup